; ModuleID = 'zip.c'
source_filename = "zip.c"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc19.44.35211"

%struct.ZIP_HEADER = type { i32, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16 }

$sprintf = comdat any

$vsprintf = comdat any

$_snprintf = comdat any

$_vsnprintf = comdat any

$printf = comdat any

$_vsprintf_l = comdat any

$_vsnprintf_l = comdat any

$__local_stdio_printf_options = comdat any

$_vfprintf_l = comdat any

$"??_C@_02JDPG@rb?$AA@" = comdat any

$"??_C@_0N@HOJHICKB@Filename?3?5?$CFs?$AA@" = comdat any

@"??_C@_02JDPG@rb?$AA@" = linkonce_odr dso_local unnamed_addr constant [3 x i8] c"rb\00", comdat, align 1, !dbg !0
@"??_C@_0N@HOJHICKB@Filename?3?5?$CFs?$AA@" = linkonce_odr dso_local unnamed_addr constant [13 x i8] c"Filename: %s\00", comdat, align 1, !dbg !7
@__local_stdio_printf_options._OptionsStorage = internal global i64 0, align 8, !dbg !12

; Function Attrs: noinline nounwind optnone uwtable
define linkonce_odr dso_local i32 @sprintf(ptr noundef %_Buffer, ptr noundef %_Format, ...) #0 comdat !dbg !35 {
entry:
  %_Format.addr = alloca ptr, align 8
  %_Buffer.addr = alloca ptr, align 8
  %_Result = alloca i32, align 4
  %_ArgList = alloca ptr, align 8
  store ptr %_Format, ptr %_Format.addr, align 8
    #dbg_declare(ptr %_Format.addr, !46, !DIExpression(), !47)
  store ptr %_Buffer, ptr %_Buffer.addr, align 8

!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!45 = !{}
!46 = !DILocalVariable(name: "_Format", arg: 2, scope: !35, file: !36, line: 1766, type: !42)
!47 = !DILocation(line: 1766, scope: !35)
!48 = !DILocalVariable(name: "_Buffer", arg: 1, scope: !35, file: !36, line: 1765, type: !40)
!49 = !DILocation(line: 1765, scope: !35)
!50 = !DILocalVariable(name: "_Result", scope: !35, file: !36, line: 1772, type: !39)
!51 = !DILocation(line: 1772, scope: !35)
!52 = !DILocalVariable(name: "_ArgList", scope: !35, file: !36, line: 1773, type: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !54, line: 72, baseType: !41)
!54 = !DIFile(filename: "C:\\Program Files\\Microsoft Visual Studio\\2022\\Community\\VC\\Tools\\MSVC\\14.44.35207\\include\\vadefs.h", directory: "", checksumkind: CSK_MD5, checksum: "a4b8f96637d0704c82f39ecb6bde2ab4")
!55 = !DILocation(line: 1773, scope: !35)
!56 = !DILocation(line: 1774, scope: !35)
!57 = !DILocation(line: 1776, scope: !35)
!58 = !DILocation(line: 1778, scope: !35)
!59 = !DILocation(line: 1779, scope: !35)
!60 = distinct !DISubprogram(name: "vsprintf", scope: !36, file: !36, line: 1465, type: !61, scopeLine: 1473, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !20, retainedNodes: !45)
!61 = !DISubroutineType(types: !62)
!62 = !{!39, !40, !42, !53}
!63 = !DILocalVariable(name: "_ArgList", arg: 3, scope: !60, file: !36, line: 1468, type: !53)
!64 = !DILocation(line: 1468, scope: !60)
!65 = !DILocalVariable(name: "_Format", arg: 2, scope: !60, file: !36, line: 1467, type: !42)
!66 = !DILocation(line: 1467, scope: !60)
!67 = !DILocalVariable(name: "_Buffer", arg: 1, scope: !60, file: !36, line: 1466, type: !40)
!68 = !DILocation(line: 1466, scope: !60)
!69 = !DILocation(line: 1474, scope: !60)
!70 = distinct !DISubprogram(name: "_snprintf", scope: !36, file: !36, line: 1939, type: !71, scopeLine: 1947, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !20, retainedNodes: !45)
!71 = !DISubroutineType(types: !72)
!72 = !{!39, !40, !73, !42, null}
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!74 = !DILocalVariable(name: "_Format", arg: 3, scope: !70, file: !36, line: 1942, type: !42)
!75 = !DILocation(line: 1942, scope: !70)
!76 = !DILocalVariable(name: "_BufferCount", arg: 2, scope: !70, file: !36, line: 1941, type: !73)
!77 = !DILocation(line: 1941, scope: !70)
!78 = !DILocalVariable(name: "_Buffer", arg: 1, scope: !70, file: !36, line: 1940, type: !40)
!79 = !DILocation(line: 1940, scope: !70)
!80 = !DILocalVariable(name: "_Result", scope: !70, file: !36, line: 1948, type: !39)
!81 = !DILocation(line: 1948, scope: !70)
!82 = !DILocalVariable(name: "_ArgList", scope: !70, file: !36, line: 1949, type: !53)
!83 = !DILocation(line: 1949, scope: !70)
!84 = !DILocation(line: 1950, scope: !70)
!85 = !DILocation(line: 1951, scope: !70)
!86 = !DILocation(line: 1952, scope: !70)
!87 = !DILocation(line: 1953, scope: !70)
!88 = distinct !DISubprogram(name: "_vsnprintf", scope: !36, file: !36, line: 1402, type: !89, scopeLine: 1411, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !20, retainedNodes: !45)
!89 = !DISubroutineType(types: !90)
!90 = !{!39, !40, !73, !42, !53}
!91 = !DILocalVariable(name: "_ArgList", arg: 4, scope: !88, file: !36, line: 1406, type: !53)
!92 = !DILocation(line: 1406, scope: !88)
!93 = !DILocalVariable(name: "_Format", arg: 3, scope: !88, file: !36, line: 1405, type: !42)
!94 = !DILocation(line: 1405, scope: !88)
!95 = !DILocalVariable(name: "_BufferCount", arg: 2, scope: !88, file: !36, line: 1404, type: !73)
!96 = !DILocation(line: 1404, scope: !88)
!97 = !DILocalVariable(name: "_Buffer", arg: 1, scope: !88, file: !36, line: 1403, type: !40)
!98 = !DILocation(line: 1403, scope: !88)
!99 = !DILocation(line: 1412, scope: !88)
!100 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 21, type: !101, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !20, retainedNodes: !45)
!101 = !DISubroutineType(types: !102)
!102 = !{!39, !39, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!104 = !DILocalVariable(name: "argv", arg: 2, scope: !100, file: !2, line: 21, type: !103)
!105 = !DILocation(line: 21, scope: !100)
!106 = !DILocalVariable(name: "argc", arg: 1, scope: !100, file: !2, line: 21, type: !39)
!107 = !DILocalVariable(name: "zip", scope: !100, file: !2, line: 22, type: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !110, line: 31, baseType: !111)
!110 = !DIFile(filename: "C:\\Program Files (x86)\\Windows Kits\\10\\Include\\10.0.26100.0\\ucrt\\corecrt_wstdio.h", directory: "", checksumkind: CSK_MD5, checksum: "bf50373b435d0afd0235dd3e05c4a277")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_iobuf", file: !110, line: 28, size: 64, align: 64, elements: !112)
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_Placeholder", scope: !111, file: !110, line: 30, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!115 = !DILocation(line: 22, scope: !100)
!116 = !DILocation(line: 23, scope: !100)
!117 = !DILocation(line: 24, scope: !118)
!118 = distinct !DILexicalBlock(scope: !119, file: !2, line: 23)
!119 = distinct !DILexicalBlock(scope: !100, file: !2, line: 23)
!120 = !DILocalVariable(name: "header", scope: !100, file: !2, line: 27, type: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ZIP_HEADER", file: !2, line: 7, size: 256, elements: !122)
!122 = !{!123, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !121, file: !2, line: 8, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 24, baseType: !125)
!125 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !121, file: !2, line: 9, baseType: !22, size: 16, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !121, file: !2, line: 10, baseType: !22, size: 16, offset: 48)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "compressionMethod", scope: !121, file: !2, line: 11, baseType: !22, size: 16, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "lastModTime", scope: !121, file: !2, line: 12, baseType: !22, size: 16, offset: 80)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "lastModDate", scope: !121, file: !2, line: 13, baseType: !22, size: 16, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !121, file: !2, line: 14, baseType: !124, size: 32, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "compressedSize", scope: !121, file: !2, line: 15, baseType: !124, size: 32, offset: 160)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressedSize", scope: !121, file: !2, line: 16, baseType: !124, size: 32, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "filenameLength", scope: !121, file: !2, line: 17, baseType: !22, size: 16, offset: 224)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "extrafieldLength", scope: !121, file: !2, line: 18, baseType: !22, size: 16, offset: 240)
!136 = !DILocation(line: 27, scope: !100)
!137 = !DILocation(line: 28, scope: !100)
!138 = !DILocation(line: 29, scope: !100)
!139 = !DILocation(line: 31, scope: !140)
!140 = distinct !DILexicalBlock(scope: !141, file: !2, line: 30)
!141 = distinct !DILexicalBlock(scope: !100, file: !2, line: 29)
!142 = !DILocation(line: 32, scope: !140)
!143 = !DILocalVariable(name: "filename", scope: !100, file: !2, line: 36, type: !144)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 128)
!147 = !DILocation(line: 36, scope: !100)
!148 = !DILocation(line: 37, scope: !100)
!149 = !DILocation(line: 38, scope: !100)
!150 = !DILocation(line: 40, scope: !100)
!151 = !DILocation(line: 41, scope: !100)
!152 = !DILocation(line: 42, scope: !100)
!153 = distinct !DISubprogram(name: "printf", scope: !36, file: !36, line: 950, type: !154, scopeLine: 956, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !20, retainedNodes: !45)
!154 = !DISubroutineType(types: !155)
!155 = !{!39, !42, null}
!156 = !DILocalVariable(name: "_Format", arg: 1, scope: !153, file: !36, line: 951, type: !42)
!157 = !DILocation(line: 951, scope: !153)
!158 = !DILocalVariable(name: "_Result", scope: !153, file: !36, line: 957, type: !39)
!159 = !DILocation(line: 957, scope: !153)
!160 = !DILocalVariable(name: "_ArgList", scope: !153, file: !36, line: 958, type: !53)
!161 = !DILocation(line: 958, scope: !153)
!162 = !DILocation(line: 959, scope: !153)
!163 = !DILocation(line: 960, scope: !153)
!164 = !DILocation(line: 961, scope: !153)
!165 = !DILocation(line: 962, scope: !153)
!166 = distinct !DISubprogram(name: "_vsprintf_l", scope: !36, file: !36, line: 1449, type: !167, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !20, retainedNodes: !45)
!167 = !DISubroutineType(types: !168)
!168 = !{!39, !40, !42, !169, !53}
!169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "_locale_t", file: !171, line: 623, baseType: !172)
!171 = !DIFile(filename: "C:\\Program Files (x86)\\Windows Kits\\10\\Include\\10.0.26100.0\\ucrt\\corecrt.h", directory: "", checksumkind: CSK_MD5, checksum: "4ce81db8e96f94c79f8dce86dd46b97f")
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__crt_locale_pointers", file: !171, line: 621, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__crt_locale_pointers", file: !171, line: 617, size: 128, align: 64, elements: !175)
!175 = !{!176, !179}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "locinfo", scope: !174, file: !171, line: 619, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "__crt_locale_data", file: !171, line: 619, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "mbcinfo", scope: !174, file: !171, line: 620, baseType: !180, size: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "__crt_multibyte_data", file: !171, line: 620, flags: DIFlagFwdDecl)
!182 = !DILocalVariable(name: "_ArgList", arg: 4, scope: !166, file: !36, line: 1453, type: !53)
!183 = !DILocation(line: 1453, scope: !166)
!184 = !DILocalVariable(name: "_Locale", arg: 3, scope: !166, file: !36, line: 1452, type: !169)
!185 = !DILocation(line: 1452, scope: !166)
!186 = !DILocalVariable(name: "_Format", arg: 2, scope: !166, file: !36, line: 1451, type: !42)
!187 = !DILocation(line: 1451, scope: !166)
!188 = !DILocalVariable(name: "_Buffer", arg: 1, scope: !166, file: !36, line: 1450, type: !40)
!189 = !DILocation(line: 1450, scope: !166)
!190 = !DILocation(line: 1459, scope: !166)
!191 = distinct !DISubprogram(name: "_vsnprintf_l", scope: !36, file: !36, line: 1381, type: !192, scopeLine: 1391, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !20, retainedNodes: !45)
!192 = !DISubroutineType(types: !193)
!193 = !{!39, !40, !73, !42, !169, !53}
!194 = !DILocalVariable(name: "_ArgList", arg: 5, scope: !191, file: !36, line: 1386, type: !53)
!195 = !DILocation(line: 1386, scope: !191)
!196 = !DILocalVariable(name: "_Locale", arg: 4, scope: !191, file: !36, line: 1385, type: !169)
!197 = !DILocation(line: 1385, scope: !191)
!198 = !DILocalVariable(name: "_Format", arg: 3, scope: !191, file: !36, line: 1384, type: !42)
!199 = !DILocation(line: 1384, scope: !191)
!200 = !DILocalVariable(name: "_BufferCount", arg: 2, scope: !191, file: !36, line: 1383, type: !73)
!201 = !DILocation(line: 1383, scope: !191)
!202 = !DILocalVariable(name: "_Buffer", arg: 1, scope: !191, file: !36, line: 1382, type: !40)
!203 = !DILocation(line: 1382, scope: !191)
!204 = !DILocalVariable(name: "_Result", scope: !191, file: !36, line: 1392, type: !205)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!206 = !DILocation(line: 1392, scope: !191)
!207 = !DILocation(line: 1396, scope: !191)
!208 = !DILocation(line: 92, scope: !14)
!209 = distinct !DISubprogram(name: "_vfprintf_l", scope: !36, file: !36, line: 635, type: !210, scopeLine: 644, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !20, retainedNodes: !45)
!210 = !DISubroutineType(types: !211)
!211 = !{!39, !212, !42, !169, !53}
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!213 = !DILocalVariable(name: "_ArgList", arg: 4, scope: !209, file: !36, line: 639, type: !53)
!214 = !DILocation(line: 639, scope: !209)
!215 = !DILocalVariable(name: "_Locale", arg: 3, scope: !209, file: !36, line: 638, type: !169)
!216 = !DILocation(line: 638, scope: !209)
!217 = !DILocalVariable(name: "_Format", arg: 2, scope: !209, file: !36, line: 637, type: !42)
!218 = !DILocation(line: 637, scope: !209)
!219 = !DILocalVariable(name: "_Stream", arg: 1, scope: !209, file: !36, line: 636, type: !212)
!220 = !DILocation(line: 636, scope: !209)
!221 = !DILocation(line: 645, scope: !209)
